app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
---
  def index
    @scan = Scan.new
    if params[:query].present?
      @beers = Beer.super_search(params[:query])
      if @beers.empty?

SELECT  "beers".* FROM "beers" WHERE "beers"."upc" = $1 LIMIT $2  [["upc", "2110100301544"], ["LIMIT", 1]]
---
  def get_barcode
    @beer = Beer.find_by(upc: params[:upc])